---
kind: method
id: M:Autodesk.Revit.UI.DockablePane.Hide
zh: 隐藏
source: html/b7e07918-5431-1af5-cc86-ce0569dc3f6b.htm
---
# Autodesk.Revit.UI.DockablePane.Hide Method

**中文**: 隐藏

If the pane is on screen, hide it. Has no effect on built-in Revit dockable panes.

## Syntax (C#)
```csharp
public void Hide()
```